<HTML>
	<HEAD>	
<meta charset="utf-8">
		<TITLE> Массивы на Паскале HTML</TITLE>
		<link rel="stylesheet" href="https://sbookas.github.io/main.css">
	<HEAD>
	<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
		
                <H1>§18. Массивы в Паскале.</H1>
               
		<H1>Основные темы параграфа:</H1><BR>
             
                 <A HREF="#массивы в Паскале">-массивы в паскале</A><BR>
                 <BR><A HREF="#описание и обработка массива на Паскале">-описание и обработка массива на Паскале</A><BR>  
                 <BR><A HREF="#описание и ввод значений в массив на Алгоритмическом языке">-описание и ввод значений в массив на Алгоритмическом языке</A><BR>
                 <BR><A HREF="#цикл с параметром на Паскале">-цикл с параметром на Паскале</A><BR> 
                 <BR><A HREF="#программа с двумя массивами">-программа с двумя массивами</A><BR>
                 <BR><A HREF="#форматы вывода">-форматы вывода</A><BR>
                 <BR><A HREF="#коротко о главном">-коротко о главном</A><BR>
                 <BR><A HREF="#вопросы и задания">-вопросы и задания</A><BR> 
                 <BR><A HREF="#тест для самопроверки">-тест самопроверки</A><BR> 
                 <BR><BR>
			 <H1><A NAME="Массивы в Паскале">Массивы в Паскале</A></H1><BR>
 <P>А теперь посмотрим, как можно на Паскале запрограммировать алгоритм вычисления среднегодовой температуры.<BR>

Для этого сначала познакомимся с правилами описания массивов. Заметим, что в данном разделе учебника мы ограничиваемся только работой с одномерными массивами (линейными таблицами).
</P>
	 <H1><A NAME="Описание и обработка массива на Паскале">Описание и обработка массива на Паскале</A></H1><BR>
 <P>Общая форма описания одномерного массива на Паскале такая:<BR>

<B>var</B> <имя массива>: <B>array</B> [<нижняя граница индекса .. верхняя граница индекса>] <B>of</B> <тип массива><br>
Слово "array" буквально переводится как "массив". Границы индекса могут быть любыми целыми числами. Важно, чтобы нижняя граница была меньше верхней границы. Описание массива температур будет следующим:<br>
<B>var</B> T: <B>array</B> [1..12] <B>of</B> real;
</P>
<H1><A NAME="Цикл с параметром на Паскале">Цикл с параметром на Паскале</A></H1><BR>
 <P>Рассмотрим полный текст программы на Паскале.<br></P>
<IMG SRC="18_1.png"><br>
<P>В этой программе дважды использован оператор цикла с параметром. Он имеет следующий формат:<br>

<B>for</B> <параметр цикла> := <начальное значение параметра> <B>to</B> <конечное значение параметра> <B>do</B> <тело цикла>;<br>
Если параметр цикла - целая переменная, то ее значение будет возрастать через единицу. Существует другой вариант этого оператора, в котором вместо слова <B>to</B> записывается <B>downto</B>. В этом случае значение параметра цикла убывает через единицу. Следовательно, начальное значение в этом случае должно быть больше конечного.<br>

Так же как и для оператора цикла <B>while</B>, здесь <I>тело цикла может быть либо простым оператором, либо составным</I>. В первом случае тело цикла заканчивается на ближайшей точке с запятой. В нашем примере - это цикл суммирования. Во втором случае тело цикла заключается между словами <B>begin</B> и <B>end</B> (цикл ввода).
	</P>
	<H1><A NAME="Форматы вывода">Форматы вывода</A></H1><BR>
 <P>В программе присутствует еще один новый для вас элемент Паскаля: формат вывода. Это числа с двоеточиями, стоящие после переменных в операторе вывода write:<BR>

write( 'Т [',I:2,']=');<BR>

В этой записи I:2 обозначает, что значение переменной I выводится как целое число в две символьные позиции на экране. Для однозначного числа в первой позиции будет помещен пробел, например: _5.<BR>

В операторе вывода результата также используется формат: Tsred: 6:2. Значение переменной Tsred выводится как смешанное число в 6 позиций, две последние из которых занимает дробная часть. В третьей справа позиции - точка. Лишние позиции для целой части занимаются пробелами. Например: _34.25.<BR>

Результат выполнения программы Temperature будет выведен на экран в следующем виде:<BR>

Среднегодовая температура =2.56 градусов.
</P>
<H1><A NAME="Программа с двумя массивами">Программа с двумя массивами</A></H1><BR>
 <P>А теперь расширим условие задачи. Требуется для каждого месяца определить отклонение его средней температуры от среднегодовой величины.<BR>

Вернемся к электронной таблице на рис. 3.13. Добавим к ней еще один столбец С, в котором будут вычисляться искомые отклонения. В ячейку С2 занесем формулу =В2-$В$14. По этой формуле вычислится отклонение январской температуры от среднегодовой. Скопировав эту формулу в ячейки СЗ:С13, получим все остальные величины. Смысл "замораживания" адреса В14 вам должен быть понятен. Результаты приведены в таблице:<BR>
<center><IMG SRC="18_2.png"></center><br>
Реализуем вычисление отклонений в программе на Паскале. Очевидно, в программе должен появиться еще один массив для размещения в нем таблицы отклонений. Дадим этому массиву имя Dt. Как и массив температур, он состоит из 12 чисел: Dt[l] , Dt[2] , Dt[3] , ..., Dt [12] .

К предыдущей программе надо добавить описание массива Dt в следующем виде:<br.

<center><B>var</B> Dt: <B>array</B>[1..12] <B>of</B> real;</center><br>
Значение каждого элемента массива равно разности между температурой соответствующего месяца и среднегодовой температурой. Например, для января: Dt[l] = Т[1] - Tsred. Такие вычисления повторяются в цикле 12 раз. Значения массива Dt выводятся на экран.,br.

Запишем на Паскале фрагмент, который надо вставить в конец предыдущей программы, чтобы решить поставленную задачу.</P>
<IMG SRC="18_3.png"><br>
<P>Здесь вычисление значений массива Dt и вывод их на экран совмещены в одном цикле. Результат работы программы будет следующим:<br>
Dt[1]= -23,56<BR>
Dt[2]= -20,56<br>
Dt[3]= -10,06<br>
…<br>
Dt[12]= -20,56<br>

Как и следовало ожидать, это те же самые числа, что получены в электронной таблице.
</P>

<H1><A NAME="Коротко о главном">Коротко о главном</A></H1><BR>
 <P>Простейший формат описания одномерного массива:
<B>var</B><имя массива>: <B>array</B> [<нижняя граница индекса .. верхняя граница индекса>] <B>of</B> <тип массива><br>
В простейшем случае оператор цикла с параметром записываетсятак:<BR>
<b>for</B><параметр цикла>:=<начальное значение параметра> <B>to</B> <конечное значение параметра><br>
 <B>do</B><тело цикла><br>
В формате вывода указывется количество позиций на экране для вывода значений.Для вещественного числа указывается также количество цифр в дробной части.<br.
В программе на Паскале должен быть описан каждый используемы й в ней массив.
</P>

<H1><A NAME="Вопросы и задания">Вопросы и задания</A></H1><BR>
 <P>1. Как можно описать на Паскале массив, в котором будут храниться значения численности населения Москвы к концу каждого года XX века?<BR>

2. Вы приобрели котенка. Каждый вечер вы определяете его вес с помощью весов. Как можно описать на Паскале массив, в котором будут храниться значения<BR>
веса котенка в течение месяца (например, мая)?<BR>

3. Напишите фрагмент программы на Паскале ввода исходных данных для массивов, определенных в заданиях 1 и 2.<BR>

4. Введите в компьютер программу Temperature, добавив к ней обработку массива Dt. Выполните программу, получите результаты. Сравните их с приведенными в<BR>
параграфе.<BR>

5. Составьте программы на Паскале по алгоритмам из заданий 3, 4 предыдущего параграфа. Выполните эти программы на компьютере.<BR>
</P>
	 <H1><A NAME="Тест для самопроверки">Тест для самопроверки</A></H1><BR>

 <P><A HREF="samoproverka18.html">Тест для самопроверки</A>
</P>
</BODY>
</HTML>

